app/controllers/favorites_controller.rb

  def create
    favo = Favorite.new
    favo.user_id=current_user.id
    favo.book_id=params[:book_id]
    # binding.pry
    favo.save
---
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 3], ["created_at", "2020-12-08 15:19:37.780984"], ["updated_at", "2020-12-08 15:19:37.780984"]]

  def destroy
    favos = current_user.favorites
    # binding.pry
    favo = favos.find_by(book_id: params[:book_id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 3], ["LIMIT", 1]]