app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2020-12-08 02:42:44.745607"], ["updated_at", "2020-12-08 02:42:44.745607"]]
---
	def create

		# current_user.follow(params[:user_id])
		current_user.relationships.create(followed_id: params[:user_id])

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 4]]
---
	def destroy
		# current_user.unfollow(params[:user_id])
		current_user.relationships.find_by(followed_id: params[:user_id]).destroy